/*За задачи от 1 до 5 (включително) използвайте базата данни "soft_uni" */

/*
Задача 4.1. Намерете всички служители със заплата над 50000
Напишете заявка, с която да откриете собственото име, фамилията
 и заплатата на тези служители, които получават повече от 50000.
 Подредете ги в низходящ ред по заплата.
*/
select `first_name`,`last_name`,`salary`
from `employees`
where `salary` >= 50000
order by `salary` desc;

/*
Задача 4.2. Намерете 5 най-добре платени служители.
Напишете заявка, с която да откриете собствените и фамилните имена на 5 най-добре
 платени служители, подредени низходящо по заплатата си. 
*/
select `first_name`,`last_name`
from `employees`
order by `salary` desc
limit 5;

/*
Задача 4.3. Сортирайте таблицата със служители
Напишете заявка, която сортира всички записи в таблицата със служители по следните критерии: 
- Първо по заплата в низходящ ред
- После по собствено име по азбучен ред
- После по фамилия в низходящ ред
- После по второ име по азбучен ред
*/
select *
from `employees`
order by 
	`salary` desc, 
	`first_name` asc, 
	`last_name` desc, 
    `middle_name` asc;
    

/*
Задача 4.4. Намерете първите 10 започнати проекта
Напишете заявка, с която да откриете първите 10 
започнати проекта. Изберете цялата информация за тях 
и ги сортирайте по начална дата, после по име. 
*/
select *
from `projects`
order by `start_date`, `name` 
limit 10;


/*
Задача 4.5. Последните 7 наети служителя
Напишете заявка, с която да откриете последните 7
 наети служителя. Изберете техните собствено и 
 фамилно име и датата, на която са наети. 
*/
select `first_name`,`last_name`,`hire_date`
from `employees`
order by `hire_date` asc
limit 7;



